Repository: kodifyme/Photo-Club-Hub
Catalog: Fotogroep Waalre Localizations/*.xcloc/Localized Contents/*.xliff
Languages: nl

# CFBundleDisplayName
source: Photo Club Hub
nl: Fotoclub Hub

# CFBundleName
source: Photo Club Hub
nl: Fotoclub Hub

# CFBundleSpokenName
source: Photo Club Hub
nl: Fotoclub Hub

source: %lld members (inc. ex-members)
nl: %lld leden (incl. ex-leden)

source: %lld photographers
nl: %lld fotografen

source: App version %@ (build %@)
nl: App versie %@ (build %@)

source: Apple
nl: Appel

source: Birthday:
nl: Verjaardag:

# Concept
source: The concept
nl: Het concept

source: Data source: %@://%@%@/
nl: Bron: %@://%@%@/

source: Data source: in-app member data.
nl: Bron: partiële in-app ledenlijst.

source: Developers wanted
nl: Ontwikkelaars in de zaal?

source: Features and tips
nl: Functionaliteit en tips

source: Fragment of the Swift source code
nl: Stukje Swift code uit de app

source: Information about a photographer's links to a photo club can be found on the Portfolio page. This page contains club-independent information such as a link to the photographer's own photography website.
nl: Deze pagina geeft een overzicht van alle fotografen die in deze app voorkomen. De beelden van een fotograaf die vertoond zijn in een specifieke fotoclub zijn te vinden op respectievelijke Portfolio paginas.

source: List of supported languages
nl: De beschikbare talen

source: Member categories
nl: Lidmaatschapstypen

source: No photo clubs seem to be currently loaded. Try dragging down the Photo Clubs screen to reload the default clubs.
nl: Er zijn geen Fotogroepen momenteel geladen. Door dit Fotogroepen scherm omlaag te slepen en los te laten worden enkele voorbeeldclubs geladen.

source: One photographer
nl: Één fotograaf

# Open Source
source: Developers
nl: Ontwikkelaars gezocht

# Paragraph_1.1
source: Photo Club Waalre is a photography club named after Waalre, a town in the south of The Netherlands. Since 1988, its club members meet to critique each other’s photos, organize excursions, and hold yearly photo expositions.
nl: De fotoclub "Fotogroep Waalre" is vernoemd naar Waalre, een dorp vlak onder Eindhoven. Sedert 1988 komen de leden van die club bijeen voor fotobespreekavonden.

# Paragraph_1.2
source: Originally the app only supported Photo Club Waalre (aka _Fotogroep Waalre_), but the current version supports **multiple** photo clubs. The app name will change soon (probably to 'Photo Club Hub') to reflect this.
nl: Oorspronkelijk ondersteunde de app uitsluitend Fotogroep Waalre, maar sedert versie 2 ondersteunt de app in principe meerdere clubs. De naam van de app 'Fotogroep Waalre' zal daarom binnenkort veranderen (waarschijnlijk 'Foto Club Hub').

# Paragraph_2.1
source: The goal of this app is to showcase curated work of members of photo clubs.
nl: Het doel van deze app is om geselecteerd werk te tonen van clubleden van fotoclubs.

# Paragraph_2.2
source: The main screen of the app shown a series of ***photo clubs***. Each photo club, in turn, contains a series of member ***portfolios***. The portfolios contain the actual images.
nl: De app heeft een hiërarchische structuur. Op het hoogste niveau vindt men de ***fotoclubs***. Binnen een fotoclubs treft men de ***portfolio's*** aan van de clubleden. Een portfolio bevat tenslotte de ***foto's*** van dat lid - althans die foto's van die betrekking hebben op de fotoclub.

# Paragraph_2.3
source: Each portfolio thus covers the subset of the photographer's work that is associated with that photo club. A photographer could have more than one portfolio in this app, if the photographer was (at some point in time) a member of multiple photo clubs.
nl: Een fotograaf kan meerdere portfolios hebben door lid te zijn (of geweest zijn) van meerdere fotoclubs. Een portfolio bevat dus alleen werk van een fotograaf dat besproken of geëxposeerde is bij één fotoclub. In principe kan een foto overigens in meerdere portfolios van die fotograaf voorkomen.

# Paragraph_2.4
source: Each portfolio is shown in chronological order, with the latest work shown first, and typical spans multiple years.
nl: De beelden in een portfolio staan in chronologische volgorde: van nieuw naar oud. Een portfolio bestrijkt namelijk vaak een periode van vele jaren.

# Paragraph_2.5
source: We try to show the portfolios with **minimal distraction**. Web sites are often less optimal for this because they need to show browser controls (e.g., an address bar or tabs) and serve multiple purposes (e.g., show club news or contact information).
nl: Net als bij een tentoonstelling is het belangrijk om een portfolio zonder afleiding te kunnen bekijken. Webpagina's zijn hiervoor vaak iets te druk wegens de bedieningselementen van de browser (zoals de adresbalk), en omdat een clubwebsite vaak ook andere doeleinden dient (bijvoorbeeld het tonen van clubnieuws).

# Paragraph_2.6
source: For Photo Club Waalre, we chose to also include the work of former club members. By default, former members are not visible, but you can configure the app to show them.
nl: De app kan, indien een club daarvoor kiest, ook de portfolio's van *voormalige* clubleden tonen. De gebruiker kan bepalen of beschikbare portfolio's van ex-leden zichtbaar zijn.

# Paragraph_2.7
source: Contact us (github@vdhamer.com) if you are interested in adding support for your photo club.
nl: Clubs met belangstelling om deel te nemen kunnen contact opnemen via github@vdhamer.com.

# Paragraph_3.1
source: __Web sites__ We regularly add features to the app. This requires some care, because we still want to maintain our focus on providing an optimal viewing experience. The app therefore explicitly does _not_ aim to replace existing websites, but instead provides links to these websites.
nl: __Websites__ Het hoofddoel van de app is om de portfolio's via een strakke presentatie tot hun recht te laten komen. Wij proberen dus _niet_ om websites te vervangen met deze app. Daarom verwijst de app de gebruiker via links desgewenst door naar clubwebsites.

# Paragraph_3.2
source: __Languages__ The app supports English and Dutch. iOS automatically selects the app's language based on your device’s language settings (_Settings > General > Language & Region > Preferred Language Order_). iOS also allows you to overrule this choice per app (_Settings > Photo Club Waalre > Language_).
nl: __Meertalig__ De app ondersteunt de Nederlands de Engelse taal. De taal van de app past zich automatisch aan op de taalinstelling van het apparaat (_Instellingen → Algemeen → Taal en regio → Volgorde voorkeurstalen_). Als alternatief kan een gebruiker de taalkeuze alleen voor deze app aanpassen (_Instellingen → Fotogroep Waalre → Voorkeurstaal_).

# Paragraph_3.3
source: __Deleting__ On the Portfolio page, you can swipe to ***Delete*** a member from the list. Don't worry - if the person is still a club member, that person will reappear the next time the app synchronizes its local data with online data. This swiping can be useful to remove members who are no longer on the online data members lists. In any case, swipe as much as you like (after all, it just might be therapeutical).
nl: __Wissen__ De gebruiker kan op de Portfolio pagina leden verwijderen door hun naam naar links te vegen. Dat verwijderen is slechts tijdelijk indien het lid nog op de online ledenlijst van de club staat: bij opnieuw synchroniseren komt dat lid automatisch weer terug. Maar dit "wegvegen" kan nuttig zijn als bijvoorbeeld een kandidaat-lid vertrekt zonder lid te worden. Hiermee verwijder je iemand uit de locale database die niet meer voorkomt in de online ledenlijst. Als alternatief kan men ook de app verwijderen en opnieuw installeren. Hiermee wordt de locale database gewist en opnieuw gevuld.

# Paragraph_3.4
source: __Roadmap__ By clicking on the above button you can (anonymously) vote for improvements you would like in future versions of this app. You can only vote once for any particular improvement.
nl: __Roadmap__ Via de blauwe knop kunt U (anoniem) stemmen op mogelijke toekomstige uitbreiding. U kan op meer dan één optie stemmen.

# Paragraph_4.1
source: When the app opens, it shows a large image corresponding to the app’s icon. If you tap somewhere ***inside*** the image, it zooms out to show the full image representing how digital cameras see color.
nl: Bij het opstarten van de app, wordt een grote versie van het logo van de app zichtbaar. Dit is een interactief speeltje. Door ***binnen het beeld*** te klikken zoomt het beeld langzaam uit tot en vierkante versie van bovenstaande foto.

# Paragraph_4.2
source: This involves a [Bayer color filter array](https://en.wikipedia.org/wiki/Bayer_filter) that filters the light per pixel. The filter array is shown here superimposed on a colorful photo.
nl: De daarop aangebrachte gekleurde vlakjes tonen hoe de kleurenfilters in een digitale camera werken. Deze [Bayer kleurenfilters](https://en.wikipedia.org/wiki/Bayer_filter) komen in vrijwel alle digitale camera's voor. Iedere kleurenfilter zorgt ervoor dat de afgedekte fotocel ("pixel") vooral gevoelig is voor licht van die ene hoofdkleur.

# Paragraph_4.3
source: Tapping ***inside*** the image allows you to zoom in or out to your heart's content. Tapping ***outside*** the image area ends the animation. You can trigger the animation again by restarting the app. A single tap ***outside*** the image allows you to skip the animation entirely.
nl: Nogmaals klikken op het beeld maakt het mogelijk om verschillende delen van het beeld-met-vlakjes te bekijken. Klik ***buiten het beeld*** om de animatie te beëindigen. De prelude is opnieuw te zien door de app volledig af te sluiten en dan opnieuw op te starten.

# Paragraph_5.1
source: The app runs on iPhone and iPad and requires iOS 16.4 or higher. Most iOS users tend to upgrade to the latest possible iOS version, which means that the app supports devices made in the last 5 or 6 years.
nl: De app ondersteunt de iPhone de iPad mits deze iOS 16.4 of hoger draaien. iOS gebruikers gaan doorgaans vrij snel over op nieuwe versies, en Apple heeft de gewoonte om apparaten minstens voor 5 jaar in de nieuwste iOS te ondersteunen. Oudere apparaten worden op de Apple App Store automatisch doorverwezen naar een oudere versie van deze app.

# Paragraph_5.2
source: The app uses various Apple software technologies including Swift (a programming language), SwiftUI (a user interface framework), Core Data (local data storage), Metal (graphics acceleration), concurrency (for fetching data), and animations.
nl: De app maakt intern gebruik van diverse __Apple__ software technologieën: Swift (een programmeertaal), SwiftUI (voor schermontwerp), Core Data (lokale dataopslag), Metal (versnelt de animatie), Concurrency (laden van data), en Animations (gebruikersinteractie).

# Paragraph_5.3
source: The benefit of an iOS focus is that it allows the developers to focus on functionality rather than cross-platform and cross-version interoperability issues.
nl: Door alleen Apple technologie te ondersteunen, kan het ontwikkelen van de app zich richten op functionaliteit in plaats van op het ondersteunen van diverse apparaten of het ondersteunen van oudere versies van het besturingssysteem.

# Paragraph_5.4
source: The drawback, however, is the lack of Android support, because the Android universe has its own set of software technologies. Apps that choose to support multiple platforms require more development effort and often contain more technical compromises.
nl: Dit heeft uiteraard wel het nadeel dat er niet gauw een __Android__ versie van deze app beschikbaar zal komen. De bekendste apps doen dit wel om de gehele mobiele markt te kunnen bedienen, maar dit vereist veel meer werk om de voortvloeiende technische beperkingen te omzeilen.

# Paragraph_5.5
source: There is another perspective on not targeting Android anytime soon: it implies the app cannot contain any essentially functionality for which there is no alternative. So, again, the app cannot replace a club's website.
nl: De keus om Android vooralsnog te negeren heeft ook een ander gevolg: de app mag eigenlijk geen essentiële functionaliteit bevatten waarvoor geen alternatief voorhanden is. En met "alternatief" denken we dus vooral aan een website.

# Paragraph_5.6
source: To put the app's device support into perspective, consider the top-6 software environments. The top-6 platforms are, in [largest-first order](https://www.youtube.com/watch?v=7S9PBgS8HS8): web, Android, Windows, iOS, iPadOS. Only the very largest apps (like MS Word, Twitter, Minecraft, Chrome) manage to cover the full range. But many well-known apps choose to focus their resources: Photoshop (Windows, MacOS, iPadOS), WhatsApp (iOS, Android, web - kind of), Pokémon Go (Android, iOS, iPadOS - kind of). So, covering three of the top-six is a decent enough score for now.
nl: Overigens, zelfs als er een Android versie van de app bestond, dan heeft een club nog altijd een website nodig voor bijvoorbeeld PC gebruikers. En voor het verlenen van andere diensten zoals clubnieuws, vergaderschema of archiveren van jaarverslagen.

# Paragraph_6.1
source: You can find this app on GitHub. This allows other software developers to contribute. Getting more developers speeds things up somewhat, but also gives fresh ideas and promotes continuity.
nl: De broncode van deze app is te vinden op GitHub. Mede omdat wij mede-ontwikkelaars zoeken om hun steentjes bij te dragen. Dit levert meer voortgang, bevordert frisse ideeën en bevordert de continuïteit.

# Paragraph_6.2
source: Welcome contributions include adding features, code improvements, ideas on architecture and interface definition, and possibly even a backend.
nl: Enkele mogelijkheden om als __software ontwikkelaar__ bij te dragen zijn: nieuwe functionaliteit, software onderhoud, meedenken over de architectuur en nieuwe interfaces, en wellicht een centrale server.

# Paragraph_6.3
source: Contributions that don't require coding are also very welcome: beta testing via TestFlight, feature requests, translations, SVG icons, sound effects, and maybe UI/UX design.
nl: Bijdragen __zonder programmeerwerk__ zijn ook welkom: testen via TestFlight, bijbehorende ideeën, meer vertalingen, iconen (SVG), geluidseffecten en meewerken aan de bedienbaarheid (UX/UI).

# Paragraph_6.4
source: A central design challenge for a next stage will be to provide a clean, standardized interface to retrieve data per photo club. The interface is needed to load the data, but also keeps the data within the app up to date. After all, membership data and portfolios change regularly. The current interface is essentially a plug-in design with an adaptor per photo club. This needs to be replaced by a standard data interface to avoid having to extend the source code whenever a new club comes aboard.
nl: Een uitdaging voor de toekomst wordt het realiseren van een elegante en gebruikersvriendelijk manier om de ledenlijst en portfolio informatie per fotoclub te delen. De interne database is hiervoor al aangepast. Een fotoclub zou straks in staat moeten zijn gegevens zelf in te voeren en deze gegevens zelf te onderhouden - dus zonder dat er aan de app iets hoeft te veranderen.

# Paragraph_6.5
source: The app currently uses a software module per club. That module loads membership and portfolio data from the club’s server and merges it into the in-app database. For Photo Club Waalre, the membership data is read from a HTML table on a password protected part of the club’s [website](https://www.FotogroepWaalre.nl). The portfolios use a somewhat more robust solution: they are read from XML files generated by a Lightroom Web plug-in called [JuiceBox-Pro](https://www.juicebox.net/tour/). Thus portfolios are created and managed as Lightroom *collections*. These collections are then uploaded to the webserver with a single _Upload_ click (thus triggering JuiceBox-Pro) where they can be downloaded by the app.
nl: Momenteel bevat de app intern een Swift klasse per fotoclub. Die software module laadt en vertaalt de gegevens van de server ("website") van de desbetreffende club en combineert de gegevens met de gegevens in de app. Bij Fotogroep Waalre, bijvoorbeeld, leest de app de ledenlijst vanuit een HTML tabel (die deel uitmaakt van een met wachtwoord afgeschermd stukje website). De app leest de portfolio's met foto's per lid vanuit XML files. Deze XML files worden automatisch gegenereerd door een Lightroom Classic plug-in ([JuiceBox-Pro](https://www.juicebox.net)). Lightroom doet dus dienst als de editor voor portfolio's (als LR _collections_). Deze portfolio's worden via een LR upload-to-web knop en JuiceBox-Pro op www.FotogroepWaalre.nl gezet. En de app leest vervolgens de actuele portfolio's als XML bestanden in vanaf deze website.

# Paragraph_6.6
source: Software developers or other volunteers who are willing to help can contact us via github@vdhamer.com. Regarding the required level of development experience: you should be good to go if you have created a complete SwiftUI app before. Alternatively, an experienced developer who is learning SwiftUI would also fit the bill. Recommended courses for learning SwiftUI are Hacking with Swift's practical [100 days of SwiftUI](https://www.hackingwithswift.com/100/swiftui/) or Stanford's fast paced and more academic online [CS193p course](https://cs193p.sites.stanford.edu).
nl: Samenvattend: wij zoeken vrijwilligers die mee willen helpen. Voor het meeprogrammeren zoeken wij mensen die eerder een eigen app gemaakt hebben op basis van SwiftUI. Of ervaren programmeurs die serieus bezig zijn met een SwiftUI cursus (b.v. [100 Days of SwiftUI](https://www.hackingwithswift.com/100/swiftui/) van _Hacking With Swift_, of het college [CS193p](https://cs193p.sites.stanford.edu) dat Stanford University online hield ivm de pandemie). Vragen over de mogelijkheden om bij te dragen graag sturen naar github@vdhamer.com.

# Paragraph_7.1
source: As an intro for developers, here is an informal tour of the ***model***. The model is a [schema](https://en.wikipedia.org/wiki/Database_schema) or information model in the database sense, or “Model“ in the sense of the [Model-View-ViewModel](https://www.hackingwithswift.com/books/ios-swiftui/introducing-mvvm-into-your-swiftui-project) design pattern. The app uses a Swift-style MVVM design, meaning model data is stored in structs rather than in classes.
nl: Tenslotte een snelle tour langs het onderliggende informatiemodel danwel [MVVM](https://www.hackingwithswift.com/books/ios-swiftui/introducing-mvvm-into-your-swiftui-project) “model”. In de SwiftUI wereld betekent dat de entiteiten in de Modellaag als _structs_ gedefinieerd worden. De Swift taal ondersteunt als moderne programmeertaal uiteraard _klassen_, maar maakt ook veel gebruik van [_structs_](https://www.avanderlee.com/swift/struct-class-differences/) en [_protocollen_](https://docs.swift.org/swift-book/LanguageGuide/Protocols.html).

# Paragraph_7.2
source: The model: every **PhotoClub** has **Members** of various types (current, former, etc.), while some Members have a formal role like chairman within the PhotoClub. Some of **Photographer**'s data (like name and birthday) are unrelated to being a Member of a PhotoClub. **Portfolios** represent the body of work of a Photographer in the context of a PhotoClub. A Portfolio contains **Images**, but an Image could be in multiple Portfolios depending on where the Image was shared. Member and Portfolio can technically be considered synonyms from a modeling perspective: we create exactly one Portfolio for each PhotoClub that a Photographer joined. They are thus a single table in the database.
nl: Hier volgt het model, inclusief de engelstalige entiteitnamen: Iedere ***PhotoClub*** heeft ***Members*** van diverse soorten (b.v. huidige leden, ex-leden). Sommige Members hebben een bestuursfunctie (b.v. voorzitter, penningmeester) binnen de PhotoClub. Members zijn eigenlijk ***Photographers***. Member is _geen_ subklasse van Photographer, omdat een Photographer lid kan zijn van meerdere PhotoClubs. Sommige informatie over Photographers (zoals naam en verjaardag) staat los van hun banden met PhotoClubs. Een Portfolio bevat het werk een Member, maar eigenlijk zijn Portfolio en Member model-technisch synoniemen. Een Portfolio is dus een chronologische reeks ***Images***. Een Image kan echter voorkomen in meerdere Portfolio's, namelijk als het in meerdere PhotoClubs besproken of geëxposeerd is.

source: Partial model
nl: Model (onvolledig)

source: Phone:
nl: Tel:

source: Photo Club Waalre
nl: Fotogroep Waalre

source: Photo Clubs
nl: Fotogroepen

# PhotoClubs_Caption
source: ① You can unlock/lock a map's scrolling and panning features using the Lock icon. ② To add extra photo clubs for testing purposes, drag down and release the top of the page. ③ An individiual photo club can be deleted by first deleting (swipe left) all linked Portfolios on the Portfolio page, and then deleting (swipe left) the photo club itself on this page.
nl: ① Het slotje kan gebruikt worden om deze landkaarten sleepbaar en inzoombaar/uitzoombaar te maken. ② Men kan enkele testfotogroepen (voor demo doeleinden) toevoegen door de bovenkant van deze pagina omlaag te slepen en los te laten (*pull to refresh*). ③ Een fotogroep kan verwijderd worden door eerst alle betrokken Portfolio's te verwijden (*swipe left*) en dan de fotoclub zelf te verwijderen (*swipe left*).

source: Preferences
nl: Instellingen

source: Readme
nl: Over deze app

source: Roadmap Items
nl: Mogelijke uitbreidingen

source: Search names
nl: Zoek op naam

source: Show aspiring members
nl: Toon aspirant-leden

source: Show club officers
nl: Toon bestuursleden

source: Show current members
nl: Toon huidige leden

source: Show deceased members
nl: Toon overleden leden

source: Show external coaches
nl: Toon externe mentoren

source: Show former members
nl: Toon ex-leden

source: Show honorary members
nl: Toon ereleden

source: The Model
nl: Voer voor nerds

source: The Prelude
nl: Prelude

source: The concept
nl: Het concept

source: To see names here, please adapt the Search filter or enable additional categories on the Preferences page.
nl: Deze lijst is leeg doordat de Zoek filter niets vindt in de gekozen ledencategorieën. Pas dus de Zoek filter aan of voeg categorieën toe (bij Instellingen).

source: To see names here, please enable additional categories on the Preferences page.
nl: Deze lijst is vermoedelijk leeg omdat er onvoldoende ledencategorieën geselecteerd zijn op het Instellingen scherm.

source: Warning: all member categories on the Preferences page are disabled. Please enable one or more options in Preferences.
nl: Waarschuwing: op de Instellingen pagina staan alle soorten leden op “niet weergeven“. Hierdoor is deze lijst leeg.

source: Who's Who
nl: Namenlijst

source: You can vote here on which roadmap items you would like to see. Please read the entire list before voting bacause you cannot undo a vote. Don't vote for more than half the items: the data helps us prioritize (this isn't about "liking" individual items).
nl: Stem hier op de nuttigste uitbreidingen in deze app. Bekijk vóór het stemmen de gehele lijst: een afgegeven stem kan niet ingetrokken worden. Stem hooguit op de helfd van de mogelijke uitbreidingen: het gaat ons om de prioriteit - het zijn dus geen "likes".

source: and
nl: en

source: chairman
nl: voorzitter

source: deceased
nl: overleden

source: external coach
nl: mentor

source: former
nl: voormalig

source: honorary member
nl: erelid

source: member
nl: lid

source: members
nl: leden

# of1
source: of
nl: van

# of2
source: of
nl: van

source: prospective member
nl: aspirant-lid

source: secretary
nl: secretaris

source: shown
nl: getoond

source: treasurer
nl: penningmeester

source: vice-chairman
nl: vicevoorzitter

source: “Current members” includes “club officers”
nl: De optie “huidige leden“ bevat “bestuursleden“
