Repository: kodifyme/Photo-Club-Hub
Catalog: Fotogroep Waalre Localizations/*.xcloc/Localized Contents/*.xliff
Languages: nl

source: “Former members” includes “deceased members”
nl: De optie “ex-leden“ bevat “overleden leden“

source: About
nl: Over deze app

source: Copyright
nl: Auteursrecht

source: Version
nl: Versie
